Revit 2024 API
BuiltInFailures.CurveByPointFailures Members
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures.CurveByPointFailures type exposes the following members.
Properties
Name | Description
UnableToGenerateCurve
 Unable to generate valid curve geometry from the driving points. The line by points will be dissolved.
See Also
BuiltInFailures.CurveByPointFailures Class
Autodesk.Revit.DB Namespace